'use client'
import { useEffect, useState } from "react"
import {  useCoumnNames } from "../hooks/useChat"
import { DataCards } from "./DataCards"

export interface Parameter {
  name: string
  checked: boolean
}

const exampleQuestions = [
   "1. Анализ на общия производствен обем с течение на времето:  Изследване на тенденцията на общото произведено количество през времето, за да се види динамиката на производството.",
   "2. Корелационен анализ между входящи суровини и краен продукт:  Определяне на връзката между използваните суровини и произведената продукция, за да се оптимизира използването на ресурси.",
   "3. Сравнителен анализ на производителността по категории:  Сравнение на показателите за производителност между различни категории или смени, за да се идентифицират разлики и потенциал за подобрение.",
   "4. Анализ на разпределението на качеството на продукцията:  Изследване на разпределението на показателите за качество, за да се оцени стабилността и консистентността на качеството.",
   "5. Бенчмаркинг на най-добри и най-лоши периоди на работа:  Идентифициране на периоди с най-висока и най-ниска производителност, за да се разберат факторите за успех и неуспех.",
   "6. Регресионен анализ за прогнозиране на производствени резултати:  Използване на регресионни модели за прогнозиране на ключови производствени показатели на базата на входни фактори.",
   "7. Анализ на влиянието на ключов входящ параметър върху изходящи резултати:  Изследване на чувствителността на производството към промени в определен входящ параметър.",
   "8. Оценка на способността на производствения процес да отговаря на изисквания за качество:  Оценка на способността на процеса да произвежда продукция в рамките на зададени спецификации.",
   "9. Анализ на загубите и добивите в производствения процес:  Изчисляване на добивите и загубите на различни етапи, за да се идентифицират възможности за оптимизация и намаляване на загубите.",
   "10. Анализ на сценарии 'какво-ако' за оптимизация на производствени параметри:  Използване на симулации за оценка на въздействието от промени в производствените параметри върху крайните резултати."
  ]

export default function QuestionsPage() {
  const [params, setParams] = useState<Parameter[]>()
  const { data: columnNames } = useCoumnNames()

  useEffect(() => {
    if (columnNames) {
      const newParams = columnNames.map((name) => ({
        name,
        checked: false
      }))
      setParams(newParams)
    }
  }, [columnNames])

  return (
    <main className="min-h-screen bg-background">
      <div className="container mx-auto py-10 px-4 max-w-7xl">
        <h1 className="text-4xl font-bold mb-10 text-center">Data Visualization Questions</h1>
        {params &&  <DataCards  parameters={params} exampleQuestions={exampleQuestions} />}
      </div>
    </main>
  )
}
